# Анализ индикаторных видов
# Вывод разобьет виды по группам (названиям биотопов). Для каждого вида будут указаны две главные цифры:
# - stat (значение индекса IndVal): от 0 до 1. Если индекс равен 1, это значит, что вид встречается только в этом биотопе (максимальная специфичность) и присутствует абсолютно на всех участках этого биотопа (максимальная встречаемость). Чем ближе к 1, тем лучше вид-индикатор.
# - p.value: статистическая значимость. Мы обращаем внимание только на те виды, у которых p-value < 0.05.

library(vegan)
library(indicspecies)

# Загружаем встроенные тестовые данные
data(dune)      # Матрица: строки - участки, столбцы - обилие видов
data(dune.env)  # Данные о среде, включая тип использования (Management)

# 3. Фиксируем генератор случайных чисел (чтобы результат перестановок всегда был одинаковым)
set.seed(123)

abund <- dune                # Матрица обилия видов
habitat <- dune.env$Management # Наш фактор (группы/местообитания)

# Используем пакет indicspecies
inv <- multipatt(abund, habitat, func = "IndVal.g", control = how(nperm=999))
summary(inv)
