# Неметрическое многомерное шкалирование

library(vegan)
library(indicspecies)

# Загружаем встроенные тестовые данные
data(dune)      # Матрица: строки - участки, столбцы - обилие видов
data(dune.env)  # Данные о среде, включая тип использования (Management)

# 3. Фиксируем генератор случайных чисел (чтобы результат перестановок всегда был одинаковым)
set.seed(123)

abund <- dune                # Матрица обилия видов
habitat <- dune.env$Management # Наш фактор (группы/местообитания)

# Построение модели NMDS
nmds <- metaMDS(abund, distance="bray", k=2)

# Визуализация (создаем пустой график, затем добавляем точки и объединяем их в полигоны по биотопам)
plot(nmds, type = "n", main="NMDS Ординация") 
points(nmds, display = "sites", pch = 16, col = as.numeric(habitat)) # Точки - это наши выборки (участки)
ordihull(nmds, groups = habitat, draw = "polygon", col = 1:4, alpha = 50) # Обводим группы
legend("topright", legend = levels(habitat), fill = 1:4) # Добавляем легенду

# Stress (Стресс): выводится в консоли при расчете (например, 0.11). Если стресс < 0.2 — график адекватно отображает реальность. Если > 0.3 — точкам на графике верить нельзя, данные слишком искажены.
# График: Каждая точка — это один участок. Чем ближе точки друг к другу, тем больше похож их видовой состав. Полигоны (области) объединяют участки одного биотопа. Если полигоны сильно пересекаются — биотопы похожи. Если полигоны разнесены в разные стороны — биотопы имеют совершенно разную фауну/флору.